# EDA/WEB Crawling/Python programming - Word note

# 01

In [100]:
# pandas 불러오기
import pandas as pd

In [101]:
# csv 파일 불러오기
df = pd.read_csv('./data/01. Seoul_CCTV.csv', encoding='utf-8')
            # 파일 경로
                                        # utf-8로 인코딩 하기
df[:2]
# df.head()   # 5번째까지 출력

   기관명    소계  2013년도 이전  2014년  2015년  2016년
0  강남구  3238       1292    430    584    932
1  강동구  1010        379     99    155    377

In [102]:
# dataframe 의 column 확인하기
df.columns

Index(['기관명', '소계', '2013년도 이전', '2014년', '2015년', '2016년'], dtype='object')

In [103]:
# DataFrame 의 column 이름 바꾸기
df.rename(columns = {df.columns[0]: '구별'}, inplace=True)
    # 이름 바꾸기
            # column 지정
                    # dictionary 형식으로 지정
                                            # 변경사항 저장
df[:2]

    구별    소계  2013년도 이전  2014년  2015년  2016년
0  강남구  3238       1292    430    584    932
1  강동구  1010        379     99    155    377

In [104]:
# excel 파일 불러오기
df_excel = pd.read_excel('./data/01. Seoul_Population.xls', header=2,\
                        # 파일 경로             
                                                            # row 2부터 데이터받기
                        usecols='B,D,G,J,N')
                        # 엑셀 컬럼의 특정 컬럼을 가져오기
df_excel[:2]

   자치구         계      계.1     계.2  65세이상고령자
0   합계  10124579  9857426  267153   1365126
1  종로구    164257   154770    9487     26182

In [105]:
# column 이름 바꾸기 2 // csv 와 방법이 같다.
df_excel.rename(
    columns = {
        df_excel.columns[0]:'구별',
        df_excel.columns[1]:'인구수',
        df_excel.columns[2]:'한국인',
        df_excel.columns[3]:'외국인',
        df_excel.columns[4]:'고령자',
        
    }, inplace = True
)
df_excel[:2]

    구별       인구수      한국인     외국인      고령자
0   합계  10124579  9857426  267153  1365126
1  종로구    164257   154770    9487    26182

In [106]:
# DataFrame 데이터 끝번호 확인하기
df_excel.tail()
        # 꼬리로부터 5개를 보여줌

     구별     인구수     한국인    외국인    고령자
21  관악구  520929  503297  17632  70046
22  서초구  445401  441102   4299  53205
23  강남구  561052  556164   4888  65060
24  송파구  671173  664496   6677  76582
25  강동구  440359  436223   4136  56161

# 02 . pandas 기초

In [107]:
# pandas 는 pd, numpy 는 np 
import numpy as np

In [108]:
s = pd.Series([1,3,5, np.nan, 6,8])
        # 데이터 형을 구성하는 기본은 Series
s

0    1.0
1    3.0
2    5.0
3    NaN
4    6.0
5    8.0
dtype: float64

In [109]:
dates = pd.date_range('20130101', periods=6)
            # 날짜를 이용할 수 있다.
                        # 시작 기준일
                                    # 일단위 기간(6일) 을 출력
dates

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [110]:
df = pd.DataFrame(np.random.randn(6,4), index=dates, columns=['A','B','C','D'])
                    # numpy 의 random.randn()의 기능
                                # 6개의 index * 4개의 column 의 칸에 난수 넣기
                                                        # column 이름 지정
df.head()

                   A         B         C         D
2013-01-01  1.622585  0.368676  0.811106 -0.755438
2013-01-02  0.686921 -1.088299  1.472346  0.567922
2013-01-03 -1.178976 -0.046007 -0.629842 -0.769138
2013-01-04  0.980404 -1.691694  0.189499  0.166101
2013-01-05  0.353988  1.207897 -2.005256  1.152213

In [111]:
# 인덱스 데이터 이름 확인
df.index

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [112]:
# DataFrame의 기본정보 확인
df.info()

<class 'pandas.core.frame.DataFrame'>
DatetimeIndex: 6 entries, 2013-01-01 to 2013-01-06
Freq: D
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   A       6 non-null      float64
 1   B       6 non-null      float64
 2   C       6 non-null      float64
 3   D       6 non-null      float64
dtypes: float64(4)
memory usage: 240.0 bytes

In [113]:
# DataFrame의 통계적 기본 정보 확인
df.describe()

              A         B         C         D
count  6.000000  6.000000  6.000000  6.000000
mean   0.367770 -0.038703  0.093593  0.205698
std    0.983495  1.154903  1.245033  0.818219
min   -1.178976 -1.691694 -2.005256 -0.769138
25%   -0.105228 -0.827726 -0.425007 -0.525054
50%    0.520454  0.161334  0.456600  0.367011
75%    0.907033  0.855077  0.789255  0.796377
max    1.622585  1.207897  1.472346  1.152213

In [114]:
# 데이터 정렬
df.sort_values(by='B', ascending=False)
                # 컬럼 기준 지정
                        # 내림차순 정렬

# df.sort_index(axis=0, ascending=False)
#               # axis = 0 : index 기준 // axis = 1 : columns 기준
#                         # 내림차순 정렬

                   A         B         C         D
2013-01-05  0.353988  1.207897 -2.005256  1.152213
2013-01-06 -0.258300  1.017211  0.723702  0.872529
2013-01-01  1.622585  0.368676  0.811106 -0.755438
2013-01-03 -1.178976 -0.046007 -0.629842 -0.769138
2013-01-02  0.686921 -1.088299  1.472346  0.567922
2013-01-04  0.980404 -1.691694  0.189499  0.166101

### pandas slice

In [115]:
# 특정 컬럼 읽기
df['A'][:2]

2013-01-01    1.622585
2013-01-02    0.686921
Freq: D, Name: A, dtype: float64

In [116]:
# 0 ~ 2 줄까지의 데이터 나타내기
df[:3]

                   A         B         C         D
2013-01-01  1.622585  0.368676  0.811106 -0.755438
2013-01-02  0.686921 -1.088299  1.472346  0.567922
2013-01-03 -1.178976 -0.046007 -0.629842 -0.769138

In [117]:
# 특정 인덱스 범위의 데이터 나타내기
df['20130102' : '20130104']     # 끝을 포함한다.

                   A         B         C         D
2013-01-02  0.686921 -1.088299  1.472346  0.567922
2013-01-03 -1.178976 -0.046007 -0.629842 -0.769138
2013-01-04  0.980404 -1.691694  0.189499  0.166101

### - loc 슬라이스

In [118]:
df.loc[:, ['A','B']]
       # 모든 행의
            # 'A','B' 열을 선택

                   A         B
2013-01-01  1.622585  0.368676
2013-01-02  0.686921 -1.088299
2013-01-03 -1.178976 -0.046007
2013-01-04  0.980404 -1.691694
2013-01-05  0.353988  1.207897
2013-01-06 -0.258300  1.017211

In [119]:
df.loc['20130102' : '20130104',['A','B']]
        # 특정 인덱스 범위의 데이터에서
                                # 'A','B' 컬럼 데이터들을 나타낸다.

                   A         B
2013-01-02  0.686921 -1.088299
2013-01-03 -1.178976 -0.046007
2013-01-04  0.980404 -1.691694

In [120]:
df.loc['20130102', ['A','B']]
        # 특정 인덱스의
                    # 'A','B' 컬럼 데이터만 나타낸다.

A    0.686921
B   -1.088299
Name: 2013-01-02 00:00:00, dtype: float64

### - iloc 슬라이스
- 번호로만 접근한다.

In [121]:
df.iloc[3]
        # index 3 의 모든 데이터 를 나타낸다.

A    0.980404
B   -1.691694
C    0.189499
D    0.166101
Name: 2013-01-04 00:00:00, dtype: float64

In [122]:
df.iloc[3:5, :2]
        # index 3,4의 데이터에서
             # 0~1 까지의 데이터만 나타낸다.

                   A         B
2013-01-04  0.980404 -1.691694
2013-01-05  0.353988  1.207897

In [123]:
print(df.iloc[[1,2,4],[0,2]])
                # index 를 사용하여 쉽게 나타낼 수 있다.
print(df.loc[['2013-01-02','2013-01-03','2013-01-05'],['A','C']])
                # 특정 값을 입력하여 나타낼 수 있다.

                   A         C
2013-01-02  0.686921  1.472346
2013-01-03 -1.178976 -0.629842
2013-01-05  0.353988 -2.005256
                   A         C
2013-01-02  0.686921  1.472346
2013-01-03 -1.178976 -0.629842
2013-01-05  0.353988 -2.005256

In [124]:
print(df.iloc[:, 1:3])
             # 전체 데이터에서 
                 # 1~2 컬럼의 데이터만 나타낸다.
print(df.loc[:, ['B','C']])
print(df.loc[:, 'B':'C'])

                   B         C
2013-01-01  0.368676  0.811106
2013-01-02 -1.088299  1.472346
2013-01-03 -0.046007 -0.629842
2013-01-04 -1.691694  0.189499
2013-01-05  1.207897 -2.005256
2013-01-06  1.017211  0.723702
                   B         C
2013-01-01  0.368676  0.811106
2013-01-02 -1.088299  1.472346
2013-01-03 -0.046007 -0.629842
2013-01-04 -1.691694  0.189499
2013-01-05  1.207897 -2.005256
2013-01-06  1.017211  0.723702
                   B         C
2013-01-01  0.368676  0.811106
2013-01-02 -1.088299  1.472346
2013-01-03 -0.046007 -0.629842
2013-01-04 -1.691694  0.189499
2013-01-05  1.207897 -2.005256
2013-01-06  1.017211  0.723702

### - 조건문 슬라이스

In [125]:
df[df['A'] > 0]
  # df['A']의 값이
            # 0 보다 큰 줄의
# 데이터를 출력한다.

                   A         B         C         D
2013-01-01  1.622585  0.368676  0.811106 -0.755438
2013-01-02  0.686921 -1.088299  1.472346  0.567922
2013-01-04  0.980404 -1.691694  0.189499  0.166101
2013-01-05  0.353988  1.207897 -2.005256  1.152213

In [126]:
df[df > 0]
    # 0 보다 작은 것은 NaN 처리 된다.

                   A         B         C         D
2013-01-01  1.622585  0.368676  0.811106       NaN
2013-01-02  0.686921       NaN  1.472346  0.567922
2013-01-03       NaN       NaN       NaN       NaN
2013-01-04  0.980404       NaN  0.189499  0.166101
2013-01-05  0.353988  1.207897       NaN  1.152213
2013-01-06       NaN  1.017211  0.723702  0.872529

In [127]:
# 컬럼 및 데이터 추가하기
df['E'] = ['one','one','two','three','four','three']
            # 위에서 차례대로 추가된다.
df

                   A         B         C         D      E
2013-01-01  1.622585  0.368676  0.811106 -0.755438    one
2013-01-02  0.686921 -1.088299  1.472346  0.567922    one
2013-01-03 -1.178976 -0.046007 -0.629842 -0.769138    two
2013-01-04  0.980404 -1.691694  0.189499  0.166101  three
2013-01-05  0.353988  1.207897 -2.005256  1.152213   four
2013-01-06 -0.258300  1.017211  0.723702  0.872529  three

In [128]:
# 특정 요소가 있는지 확인
df['E'].isin(['two','four'])

2013-01-01    False
2013-01-02    False
2013-01-03     True
2013-01-04    False
2013-01-05     True
2013-01-06    False
Freq: D, Name: E, dtype: bool

In [129]:
# 특정 요소가 있는 행만 선택
df[df['E'].isin(['two','four'])]
    #[df['E'].isin(['two','four'])] 에 해당하는 index값을 반환하면
# df[] 로 데이터를 출력하게 된다.

                   A         B         C         D     E
2013-01-03 -1.178976 -0.046007 -0.629842 -0.769138   two
2013-01-05  0.353988  1.207897 -2.005256  1.152213  four

### - 특정 컬럼 제거
- `del` 사용

In [130]:
del df['E']
df[:2]

                   A         B         C         D
2013-01-01  1.622585  0.368676  0.811106 -0.755438
2013-01-02  0.686921 -1.088299  1.472346  0.567922

### - 각 컬럼 누적합 (apply)

In [132]:
df.apply(np.cumsum)
         # numpy 기능 cumsum

                   A         B         C         D
2013-01-01  1.622585  0.368676  0.811106 -0.755438
2013-01-02  2.309506 -0.719623  2.283451 -0.187517
2013-01-03  1.130530 -0.765630  1.653610 -0.956655
2013-01-04  2.110934 -2.457324  1.843108 -0.790554
2013-01-05  2.464922 -1.249427 -0.162147  0.361659
2013-01-06  2.206622 -0.232216  0.561555  1.234188